{
  "metadata": {
    "/": {
      "title": "Robotmaster CAD/CAM for robots (Off-Line Programming)",
      "description": "Robotmaster is the ideal off-line, CAD/CAM robot programming solution, delivering quick, error-free robot programs for 3D machining, trimming, welding, dispensing."
    },
    "/about": {
      "title": "CAD/CAM Software | Industrial Robot Programming - robotmaster.com",
      "description": "We provide industrial robot programming technologies that enable versatile and profitable robotic solutions for industrial manufacturing. Contact us today."
    },
    "/products": {
      "title": "Robot Programming For CAD/CAM - robotmaster.com",
      "description": "Robotmaster integrates robot programming, simulation and code generation to a streamlined CAD/CAM engine, delivering quicker, optimized robot programming."
    },
    "/partners": {
      "title": "Robotmaster Supported Preferred Partners - robotmaster.com",
      "description": "Robotmaster collaborates with the following robot manufacturers and integrators to offer full turn-key robot solutions for industrial applications."
    },
    "/products/whats-new-in-v6": {
      "title": "Robot Simulation & Robot Programing Software For CAD/CAM",
      "description": "ROBOTMASTER V6 features RISE, Robotmaster’s new Interactive Simulation Environment, to provide a unique integration of user control and intervention"
    },
    "/applications": {
      "title": "Robotics Programming For Industrial Applications - robotmaster.com",
      "description": "Robotmaster is ideal for programming such tasks as trimming, 3D machining, deburring, polishing, welding, dispensing, grinding, painting and more."
    },
    "/applications/trimming": {
      "title": "Robot Programming For Trimming, Routing & Water Jet Cutting",
      "description": "Robotmaster can be used for robot programming for trimming applications such as routing, cutting & more. Discover the advantages of our trimming applications."
    },
    "/applications/machining": {
      "title": "Robotic Machining | CAD/CAM Milling | Milling Programming",
      "description": "Robotmaster CAD/CAM programming can use automated systems for robotic milling of simple or complex parts. Discover the advantages for milling applications."
    },
    "/applications/deburring": {
      "title": "Robotic Deburring | CAD/CAM Programming - robotmaster.com",
      "description": "Robotmaster delivers industrial robot program solutions that can be used for deburring rough edges. Discover the advantages of our CAD/CAM programming."
    },
    "/applications/welding": {
      "title": "Robotic Welding Programming | CAD Programming - robotmaster.com",
      "description": "Discover robot programming for welding. Generated automatically from CAD models, optimized to adjust for weld bead size, distance to part, gun tilt & more."
    },
    "/applications/polishing": {
      "title": "Robotic Polishing | CAD/CAM for Robots - robotmaster.com",
      "description": "Robotmaster can be used for programming the automation of robotic sanding and polishing applications. Discover the advantages of our CAD/CAM programming."
    },
    "/applications/dispensing": {
      "title": "Robotic Dispensing | CAD/CAM Robotics - robotmaster.com",
      "description": "The Robotmaster CAD/CAM software can be used for programming dispensing applications. Discover versatile and profitable robot programming solutions."
    },
    "/applications/deflashing": {
      "title": "Programming Deflashing | Robotics Programming - robotmaster.com",
      "description": "Robotmaster can be used to program robots for deflashing and compliant knife trimming applications, automatically from the CAD model. Contact us today."
    },
    "/applications/paint": {
      "title": "Robot Programming For Automated Painting & Spray Coating - robotmaster.com",
      "description": "Robotmaster can generate robot painting programs optimized to ensure spray consistency, nozzle diameter, & much more. Discover robotic software advantages."
    },
    "/applications/rail-rotary": {
      "title": "Rail & Rotary Robot Programming & Simulation - robotmaster.com",
      "description": "Robotmaster can be used to program a robot equipped with a linear rail and parts mounted on a rotary table,  as indexers or in full simultaneous motion."
    },
    "/applications/part-to-tool": {
      "title": "Robotmaster Programming Part To Tool Applications - robotmaster.com",
      "description": "For part-to-tool applications, programs can be generated automatically from the CAD model and adjusted for cutter size or tool contact location"
    },
    "/applications/additive-manufacturing": {
      "title": "Robotic Additive Manufacturing | CAD/CAM Robot Programming",
      "description": "Our additive programming applications can be applied to a variety of robotic manufacturing processes including FDM, LMF, LMD and much more. Learn more online."
    },
    "/why-robotmaster": {
      "title": "Robotic Programming | Robot software | Industrial Robotics ",
      "description": "Robotmaster uses mature CAD/CAM software technologies to program robots with flexibility and speed! Learn how to get the most out of robots with Robotmaster."
    },
    "/why-robotmaster/evolution-chart": {
      "title": "Evolution Of Robot Programming | CAD/CAM Point Converter",
      "description": "Getting the most out of robots using Industrial Robot Programming – where are you in the robot programming technology evolution?"
    },
    "/why-robotmaster/benefits": {
      "title": "Program a Robot & Solving Robot Programming Challenges - robotmaster.com",
      "description": "Struggling how to program a robot the way you do a CNC machine tool? The experts at Robotmaster are up to the challenge. Robotmaster easily solves the following problems:"
    },
    "/success-stories": {
      "title": "Robotmaster Success Stories - robotmaster.com",
      "description": "Case studies of customers who have successfully solved their robot programming challenges by using Robotmaster."
    },
    "/success-stories/flow-automation": {
      "title": "Robotics Software | Robot Programming Software - robotmaster.com",
      "description": "Discover how Robotmaster's robotics software helps improve the efficiency of robots. Learn about the path sensitive, off-line robot programming software today."
    },
    "/contact": {
      "title": "Contact Us | Robotmaster - Robotmaster.com",
      "description": "Visit us online at www.robotmaster.com or feel free to call us today. We're here to answer any questions you may have. Thanks!"
    },
    "/newsroom": {
      "title": "Robotmaster Blog - Robotmaster.com",
      "description": "Want to stay up to date on all our news and events? Bookmark our blog for the latest and greatest from Robotmaster. Visit us online at our blog or call us today!"
    },
    "/newsroom/robotmaster-at-automatica-2014": {
      "title": "Robotmaster Exhibit at AUTOMATICA 2014",
      "description": "Robotmaster will be exhibiting at AUTOMATICA, the International Trade Fair for Automation and Mechatronics that runs from June 3 to 6 2014 in Munich (Germany)."
    },
    "/newsroom/jabez-makes-cover-of-cio-review-magazine": {
      "title": "10 Most Promising Engineering Solution Providers - Jabez Technologies",
      "description": "Jabez Technologies (developers of Robotmaster) makes the cover of CIO Review Magazine and gets recognized as one of the 10 Most Promising Engineering Solution Providers for 2014."
    },
    "/newsroom/jabez-released-robotmaster-v6-1": {
      "title": "Robotmaster V6.1 - Enhanced Robot Process Control and Simulation",
      "description": "Jabez Technologies has just released Robotmaster V6.1. Building on the Robotmaster Interactive Simulations Environment introduced in 2013, V6.1 Call now to learn more."
    },
    "/newsroom/jabez-wins-game-changer-awards": {
      "title": "Jabez Technologies Wins Game Changer Awards - robotmaster.com",
      "description": "ROBOTMASTER V6 seamlessly integrates robot programming, simulation and code generation inside CAM software, delivering quicker robot programming. Call now to learn more."
    },
    "/newsroom/jabez-release-robotmaster-v6": {
      "title": "Robotmaster V6 - The New Interactive Simulations Environment",
      "description": "The new and intuitive V6 interface elevates Robotmaster to an unprecedented standard of user experience by giving robot programmers a coherent and dynamic tool."
    },
    "/newsroom/intuitive-robot-programming-for-aerospace-manufacturing": {
      "title": "Robot Programming for Aerospace Manufacturing - robotmaster.com",
      "description": "As flexible tools for aircraft manufacturing and assembly, Robots will likely transform the aerospace industry. Read more at robotmaster.com"
    },
    "/newsroom/csf-robotics-becomes-a-robotmaster-reseller": {
      "title": "CSF Robotics becomes a Robotmaster reseller",
      "description": "We are proud to announce that CSF Robotics becomes a Robotmaster reseller for Australia and the Asia Pacific region."
    },
    "/newsroom/robotmaster-has-its-first-authorized-distributor-in-thailand": {
      "title": "Robotmaster has its first authorized distributor in Thailand",
      "description": "We are proud to announce that Golden Robot has become the first authorized distributor of Robotmaster in Thailand"
    },
    "/newsroom/amrc-lends-a-hand-to-sheffield-students-racing-team": {
      "title": "AMRC | Advanced Manufacturing Research Centre - robotmaster.com",
      "description": "University of Sheffield's AMRC used Robotmaster to design and manufacture a racing car for the student racing team. Read more at robotmaster.com"
    },
    "/newsroom/robotmaster-asia-leads-the-robotic-revolution-at-beijing-essen-welding-&-cutting-2015": {
      "title": "Robotic Revolution | Beijing Essen Welding - robotmaster.com",
      "description": "Robotmaster lead the robotic revolution at the Beijing Essen Welding & Cutting fair this year. Learn how our unique programming technologies contributed."
    },
    "/newsroom/robotmaster-now-supporting-nachi-brand-of-robot": {
      "title": "NACHI Robots | Robot Manufacturer - robotmaster.com",
      "description": "As a leader in offline programming software for robotics, Robotmaster is now supporting the NACHI brand of robots in Japan. Read more at robotmaster.com"
    },
    "/newsroom/composites-and-robotmaster": {
      "title": "Robotic Composite Manufacturing & Trimming - robotmaster.com",
      "description": "Robotmaster demonstrates cost-effective and cutting edge programming tools for composite manufacturing. Learn more at robotmaster.com"
    },
    "/newsroom/robotm-br-reinforces-the-growing-presence-of-robotmaster-in-latin-america-at-feimafe-2015": {
      "title": "Feimafe | Robotmaster in Latin America- robotmaster.com",
      "description": "Feimafe allowed Robotmaster to be part of cutting edge technology from across the globe. Learn about the premier conference and trade show for machining."
    },
    "/newsroom/hypertherm-expands-robotic-capabilities-with-purchase-of-jabez-technologies": {
      "title": "Hypertherm Software | Robotic Software - robotmaster.com",
      "description": "Hypertherm expands robotic capabilities with the purchase of Jabez Technologies, making it easier for companies to utilize robots for manufacturing. Read more."
    }
  },
  "general-learn-more-dotted": "Learn more...",
  "general-learn-more": "Learn more",
  "general-read-more": "Read more",
  "general-read-full": "Read full story",
  "general-send": "Send",
  "about-page-caption": "About Robotmaster",
  "about-title-1": "Our Story",
  "about-title-2": "Our Team",
  "about-story-1": "Robotmaster helps manufacturers to maximize their productivity by easy and efficient industrial robot programming. Our leading off-line programming software provides quick and easy programming tools for multiple applications, saving time and money while maximizing return on investment.",
  "about-story-2": "The idea was born in 2001 - we were unwilling to accept the prevailing industry belief that teaching was the best way to program industrial robots. We set out to show that off-line programming powered by CAD/CAM software was the key to productivity and quality.",
  "about-story-3": "In 2002, we unveiled the first version of Robotmaster CAD/CAM robotic software. An overwhelmingly positive response from robot integrators and manufacturers proved we were on the right track. This led us to combine our expertise in CAD/CAM software development technologies with applied mathematics and robot kinematics to perfect and extend the suite of functionalities found in Robotmaster software.",
  "about-story-4": "In the years that followed, we continued to evolve the industrial robotic software, expanding to support a vast array of industrial robots across multiple industries. Today Robotmaster-powered robots are adept at jobs such as trimming and cutting, {roboticMachining}, deburring, welding, polishing, sanding, painting and more.",
  "about-story-5": "The capabilities of Robotmaster have not gone unnoticed, winning praise and accolades from customers and media alike. The software’s ability to make the programming of industrial robots fast, easy, and efficient earned it the Game Changer Award for Motion Control at the 2013 RoboBusiness Conference. In 2015, CIO Review Magazine named us to its list of the 20 Most Promising Robotics Solutions Providers.",
  "about-story-6": "Now part of the Hypertherm family, operating as Hypertherm Robotic Software Inc., we are able to leverage Hypertherm’s global infrastructure to serve rapidly evolving industry requirements and challenges and make it easier for robotic programmers and integrators worldwide to achieve optimal results.",
  "about-flavor-2002-1": "FIRST IMPLEMENTATION OF 6-AXIS PROGRAMMING WITH ROBOTMASTER V1",
  "about-flavor-2003-1": "FIRST APPLIED TO FANUC, MOTOMAN, AND STAUBLI ROBOTS",
  "about-flavor-2004-1": "FOCUS ON TRIMMING AND MILLING",
  "about-flavor-2005-1": "KINEMATICS CAPABILITIES ADDED",
  "about-flavor-2008-1": "OPTIMIZATION FUNCTIONALITY IS INTRODUCED",
  "about-flavor-2011-1": "ROBOTMASTER V5 RELEASED IMPLEMENTS WORKSPACE ANALYSIS AND OPTIMIZATION OF EXTERNAL AXES",
  "about-flavor-2013-1": "ROBOTMASTER INTERACTIVE SIMULATION ENVIRONMENT (RISE) IS RELEASED - ",
  "about-flavor-2013-2": "RBR GAME CHANGER AWARDS WINNER",
  "about-flavor-2014-1": "CIO REVIEW TOP 10 ENGINEERING DESIGN SOLUTIONS PROVIDER",
  "about-flavor-2015-1": "ROBOTMASTER JOINS THE HYPERTHERM FAMILY",
  "about-flavor-2015-2": "CIO TOP 20 ROBOTICS SOLUTIONS PROVIDER",
  "about-team-1": "We are 100% robot focused – our growing multi-disciplinary team of researchers, developers and engineers continue to carry out research to bring innovative and novel tools to enable enhanced robot performance in a growing range of applications.",
  "about-team-2": "We have assembled an exceptional team of experts and practitioners in the technologies required “under the hood” to power the tools that make robotics programming easier for our clients. State-of-the-art robotics including kinematics, mathematical optimization, simulation and CAD/CAM algorithms are developed by the Robotmaster team to create the foundation for our solutions.",
  "about-team-3": "The Robotmaster team is committed to deliver our promise to the robotics and manufacturing industries, and to our partners and customers, that we will continue to strengthen our position as the leading robot programming solutions innovator.",
  "about-team-4": "Equally important, we have created strategic alliances with major players in the robot manufacturing industry to assure the delivery of seamlessly integrated, leading-edge solutions to our users.",
  "about-team-5": "And at Hypertherm, we aren’t just employees, we’re owners. Ownership is a powerful motivator that ensures our customers, not investors, are our top priority. As owners, we make sure our product is built to the highest quality and that our service is second to none.",
  "application-page-caption": "Applications",
  "application-learn-more": "Learn more",
  "application-coming-soon": "Description coming soon.",
  "application-videos": "Videos",
  "application-title-1": "Robotmaster at the core of your process",
  "application-text": "Robotmaster addresses the needs of a wide variety of manufacturing applications with tools tailored to the specific needs of each process, providing intuitive, automated task programming for error-free results without specialized CAD/CAM or robotics expertise.",
  "application-cutting": "Cutting",
  "application-machining": "Machining",
  "application-trimming": "Trimming",
  "application-welding": "Welding",
  "application-polishing": "Polishing/Sanding",
  "application-dispensing": "Dispensing",
  "application-deburring": "De-burring",
  "application-paint": "Paint/Spray Coating",
  "application-surface": "Surface Treatment",
  "application-coop": "Cooperative robotics",
  "application-addman": "Additive Manufacturing",
  "application-deflashing": "Deflashing",
  "application-part": "Part to Tool",
  "application-rail": "Rail/Rotary",
  "app-addman-para-1": "Robotmaster can be used for easy programming of all robotic additive manufacturing processes including:",
  "app-addman-list-1-1": "Fused deposition modeling (FDM)",
  "app-addman-list-1-2": "Laser metal fusion (LMF)",
  "app-addman-list-1-3": "Laser Metal Deposition (LMD) including laser cladding",
  "app-addman-list-1-4": "Deposition Welding",
  "app-addman-list-1-5": "Composite Lay-Up",
  "app-addman-list-1-6": "3D printing",
  "app-addman-subhead-1": "Advantages of Robotic Additive Manufacturing",
  "app-addman-para-2": "Automated programming for robotic additive manufacturing applications can be generated from CAD models and subsequently modified with minimal effort to adjust for all process based parameters",
  "app-addman-list-2-1": "Fast process implementation",
  "app-addman-list-2-2": "Easy and error free robotic programming",
  "app-addman-list-2-3": "Optimal use of the robots kinematics for superior motion control",
  "app-addman-list-2-4": "Visual validation by simulating material buildup",
  "app-addman-vid-1": "https://www.youtube.com/watch?v=XpCARmhQPPU",
  "app-addman-vid-1-text": "3D printing using a Motoman robot",
  "app-addman-vid-2": "https://www.youtube.com/watch?v=Eln2C-XzCDs",
  "app-addman-vid-2-text": "3D printing an aerospace part using an ABB robot",
  "app-addman-vid-3": "https://www.youtube.com/watch?v=NCmER-0PFJg",
  "app-addman-vid-3-text": "Additive laser cladding an aerospace part",
  "app-addman-vid-4": "https://www.youtube.com/watch?v=5USrH4crKHM",
  "app-addman-vid-4-text": "Laser cladding a propeller using a Fanuc robot",
  "app-addman-vid-5": "https://www.youtube.com/watch?v=TQOqxY7-NqY",
  "app-addman-vid-5-text": "Laser cladding/additive manufacturing a propeller blade with a KUKA robot",
  "app-addman-vid-6": "https://www.youtube.com/watch?v=7AaXY_cGhx4",
  "app-addman-vid-6-text": "Wire + Arc additive manufacturing with a KUKA robot",
  "app-addman-vid-7": "https://www.youtube.com/watch?v=2kRcPqUFSJM",
  "app-addman-vid-7-text": "Wire feed additive manufacturing a dumbell with a KUKA robot",
  "app-cutting-para-1": "Robot work cells are flexible cost effective solutions for cutting complex shapes on 2 or 3D surfaces using laser, plasma, water-jet, gas cutting, or compliant knife tooling, with high speed and precision, without additional finishing steps. Robotmaster automatically programs smooth error-free tool motion and transitions, exploiting your cutting technology parameters to cut accurate shapes and true arcs, and flexible control of external axes.",
  "app-cutting-subhead-1": "Advantages for cutting applications",
  "app-cutting-para-2": "Robot programming for trimming and cutting paths can be generated automatically from the CAD model and subsequently modified with minimal effort to adjust for:",
  "app-cutting-list-1-1": "Diameter of cutter",
  "app-cutting-list-1-2": "Depth of cut",
  "app-cutting-list-1-3": "Number of cuts",
  "app-cutting-list-2-1": "Tool orientations can be managed automatically to optimize the program for minimal wrist rotation and maximize robot reach",
  "app-cutting-list-2-2": "Ability to manage and optimize entries and exits",
  "app-cutting-list-2-3": "Ability to automatically activate/deactivate spindle or tool",
  "app-cutting-list-2-4": "Joint repositioning tools can be used to easily control the robot configurations and wrist winding/unwinding for optimal trimming trajectories",
  "app-cutting-list-2-5": "Ability to program, simulate and use multiple tools",
  "app-cutting-list-2-6": "Calibration tools that compensate for actual part setup",
  "app-cutting-vid-1": "https://www.youtube.com/watch?v=6aV4biH5bFM",
  "app-cutting-vid-1-text": "Robotic programming for plasma cutting holes into a steel dome",
  "app-cutting-vid-2": "https://www.youtube.com/watch?v=A12ZLJFF42k",
  "app-cutting-vid-2-text": "Robot programming for water-jet cutting of a medical carbon fiber part using a Motoman robot",
  "app-cutting-vid-3": "https://www.youtube.com/watch?v=sYnRhN5sV3Y",
  "app-cutting-vid-3-text": "Robotic programming for laser cutting of a B-pillar part",
  "app-cutting-vid-4": "https://www.youtube.com/watch?v=K_nR4_RxgmY",
  "app-cutting-vid-4-text": "Robot programming for laser cutting",
  "app-coop-vid-1": "https://www.youtube.com/watch?v=q5CMcn0d6UE",
  "app-coop-vid-1-text": "Two Fanuc robots simultaneously working together to thermal spray a turbine blade",
  "app-deburring-para-1": "Robotmaster can be used to generate a robot program for deburring rough edges of machined parts or gears, or for any other process that requires smoothing of edges or surfaces using a variety of tools and techniques including mills, rotary files, abrasive disks, brushes and pads.",
  "app-deburring-subhead-1": "Advantages for Robotic Deburring Applications",
  "app-deburring-para-2": "Robot programming for deburring gears or other machined parts can be generated automatically from the CAD model and subsequently modified with minimal effort to adjust for:",
  "app-deburring-list-1-1": "Change of cutter shape",
  "app-deburring-list-1-2": "Diameter of cutter",
  "app-deburring-list-1-3": "Depth of cuts",
  "app-deburring-list-1-4": "Number of cuts",
  "app-deburring-list-1-5": "And many additional",
  "app-deburring-list-2-1": "Ability to program and manage tool tilt directions for optimal surface contact increasing the surface finish quality and tool life",
  "app-deburring-list-2-2": "Tool orientations can be managed automatically to optimize the program for minimal wrist rotation and maximize welding robot reach",
  "app-deburring-list-2-3": "Joint repositioning tools can be used to easily control the robot configurations and wrist winding/unwinding for optimal deburring trajectories",
  "app-deburring-list-2-4": "Joint repositioning tools can be used to easily control the robot configurations and wrist winding/unwinding for optimal milling trajectories",
  "app-deburring-list-2-5": "Ability to program, simulate and use multiple robotic deburring tools",
  "app-deburring-list-2-6": "Calibration tools that compensate for actual part setup",
  "app-deburring-vid-1": "https://www.youtube.com/watch?v=TE-01Ht4R4U",
  "app-deburring-vid-1-text": "Robotic CAD/CAM programming for de-burring a wheel using a KUKA robot",
  "app-deburring-vid-2": "https://www.youtube.com/watch?v=sxa3JLkXk3c",
  "app-deburring-vid-2-text": "Robotic CAD/CAM programming for de-burring joint 5 of a KUKA robot",
  "app-dispensing-para-1": "Robotmaster can be used for programming the robotic dispensing of adhesives and seals.",
  "app-dispensing-subhead-1": "Advantages for Robotic Dispensing Applications",
  "app-dispensing-list-1-1": "A CAD/CAM robotics program for dispensing of seals and adhesives can be generated automatically from a CAD model and subsequently modified with minimal effort to adjust for bead size, nozzle or applicator tip diameter",
  "app-dispensing-list-1-2": "Seal paths can be programmed directly using the groove geometries in the CAD model for fast and accurate dispensing",
  "app-dispensing-list-1-3": "Ability to automatically activate/deactivate the applicator",
  "app-dispensing-list-1-4": "Tool orientations can be managed automatically to optimize the CAD/CAM robotics program for minimal wrist rotation and maximize robot reach",
  "app-dispensing-list-1-5": "Joint repositioning tools can be used to easily control the dispensing robot configurations and wrist winding/unwinding for optimal milling trajectories",
  "app-dispensing-list-1-6": "Calibration tools that compensate for actual part setup",
  "app-dispensing-vid-1": "https://www.youtube.com/watch?v=Wc1hY5kxE3w",
  "app-dispensing-vid-1-text": "ABB robot program dispensing adhesives to engine blocks",
  "app-dispensing-vid-2": "https://www.youtube.com/watch?v=psduWFyNCNI",
  "app-dispensing-vid-2-text": "Robotmaster CAD/CAM program for dispensing on an engine block",
  "app-deflashing-para-1": "Robotmaster can be used for robotics programming of deflashing and compliant knife trimming applications.",
  "app-deflashing-subhead-1": "Advantages for deflashing applications",
  "app-deflashing-list-1-1": "Deflashing programs can be generated automatically from the CAD model and subsequently modified with minimal effort to adjust for knife size and knife to edge distance",
  "app-deflashing-list-1-2": "Deflashing tool orientations can be managed automatically to optimize the program for minimal wrist rotation, maintain knife parallel to part edge and maximize robot reach",
  "app-deflashing-list-1-3": "Calibration tools that compensate for actual part setup",
  "app-deflashing-vid-1": "https://www.youtube.com/watch?v=gvfWlGo7-Ds",
  "app-deflashing-vid-1-text": "Deflashing of a car steering wheel",
  "app-surface-para-1": "Robots produce consistent, high-quality surface finishing and hardening with greater throughput in the face of a worldwide shortage of skilled surface finishing craftsmen. Robotmaster rapidly creates specialized robot paths directly from the CAD model using process knowledge to fine-tune for optimum surface finish and hardness delivering predictable results.",
  "app-surface-para-2": "Robotmaster has pioneered in offering specialized, easy and highly optimized programming tools for robotic surface treatments including:",
  "app-surface-list-1-1": "Shot peening",
  "app-surface-list-1-2": "Media blasting",
  "app-surface-list-1-3": "Hammer peening",
  "app-surface-list-1-4": "Laser hardening",
  "app-surface-vid-1": "https://www.youtube.com/watch?v=UAC8TPaiZMA",
  "app-surface-vid-1-text": "Shot peening landing gear",
  "app-surface-vid-2": "https://youtu.be/4Ut7ZDr4dRY",
  "app-surface-vid-2-text": "Hammer peening a section of automotive die",
  "app-machining-para-1": "Robotic milling offers versatility to create simple or complex parts of any size with lower equipment and operating costs. Robotmaster harnesses the full power of robots, without the programming complexity, by using a unique robot specific CAD/CAM approach to automatically drive milling robots.",
  "app-machining-subhead-1": "Advantages for robotic milling applications",
  "app-machining-para-2": "Automated milling programming for robotic machining applications can be generated from CAD models and subsequently modified with minimal effort to adjust for:",
  "app-machining-list-1-1": "Change of cutter shape",
  "app-machining-list-1-2": "Diameter of cutter",
  "app-machining-list-1-3": "Depth of cuts",
  "app-machining-list-1-4": "Number of cuts",
  "app-machining-list-2-1": "Automated generation of roughing and finishing programs",
  "app-machining-list-2-2": "Memory management output for long programs",
  "app-machining-list-2-3": "Tool orientations can be managed automatically to optimize the program for minimal wrist rotation and maximize robot reach",
  "app-machining-list-2-4": "Joint repositioning tools can be used to easily control the robot configurations and wrist winding/unwinding for optimal milling trajectories",
  "app-machining-list-2-5": "Ability to program, simulate and use multiple tools",
  "app-machining-list-2-6": "Calibration tools that compensate for actual part setup",
  "app-machining-vid-1": "https://www.youtube.com/watch?v=xSZnTGTRIL4",
  "app-machining-vid-1-text": "Machining a statue model head using a Kawasaki robot",
  "app-machining-vid-2": "https://www.youtube.com/watch?v=LzAvqCgni-8",
  "app-machining-vid-2-text": "Milling of a mold using a Staubli robot",
  "app-machining-vid-3": "https://www.youtube.com/watch?v=_wdkIhkWpDM",
  "app-machining-vid-3-text": "Automotive clay milling for prototype use",
  "app-part-para-1": "Robotmaster can be used for programming part to tool applications.",
  "app-part-subhead-1": "Advantages for part to tool applications",
  "app-part-list-1-1": "Automatic programming for part to tool applications from CAD models and subsequent modification to adjust for cutter size or tool contact location with minimal effort",
  "app-part-list-1-2": "Part to tool orientations can be managed automatically to optimize the program for minimal wrist rotation and maintaining constant orientation between part edge and tool",
  "app-part-list-1-3": "Ability to program, simulate and use multiple tools",
  "app-part-vid-1": "https://www.youtube.com/watch?v=jQUaltNEoyc",
  "app-part-vid-1-text": "Simulation of polishing a prosthetic knee",
  "app-part-vid-2": "https://www.youtube.com/watch?v=so-gbsb10G8",
  "app-part-vid-2-text": "Simulation of polishing",
  "app-paint-para-1": "Robots can precisely control spray angle, speed and flow intensity for complete and consistent coverage over complex surfaces. Robotmaster simulates coverage using spray parameters to automate the programming of optimized paths, ensuring precise coverage over all surfaces with minimal effort.",
  "app-paint-subhead-1": "Advantages for robot painting and spray-coating applications",
  "app-paint-para-2": "Spray-coating programs for robots can be generated automatically from the CAD model and subsequently modified with minimal effort to adjust for:",
  "app-paint-list-1-1": "Change of spray shape",
  "app-paint-list-1-2": "Nozzle diameter",
  "app-paint-list-1-3": "Nozzle to part distance",
  "app-paint-list-1-4": "Depth of passes",
  "app-paint-list-1-5": "Number of coats",
  "app-paint-list-2-1": "Entry/exit can be managed to extend automatically beyond the CAD model",
  "app-paint-list-2-2": "Automatically manage and change the distance between steps without re-programming the part",
  "app-paint-list-2-3": "Even step distances ensure spray consistency",
  "app-paint-list-2-4": "Tool orientations can be managed automatically to optimize the program for minimal wrist rotation and maximize robot reach",
  "app-paint-vid-1": "https://www.youtube.com/watch?v=p-N5DHEyTSI",
  "app-paint-vid-1-text": "Thermal spraying a turbine blade",
  "app-paint-vid-2": "https://www.youtube.com/watch?v=bukuVL5G7YU",
  "app-paint-vid-2-text": "Thermal spraying of a turbine transition duct",
  "app-polishing-para-1": "Robots produce consistent, high-quality finishing with greater throughput while reducing the exposure of workers to the contaminants, noise and monotony of grinding, polishing and sanding processes. Robotmaster rapidly creates robot paths directly from the CAD model, even for setups in which the robot moves the part, using process knowledge to fine-tune for optimum surface finish and predictable results.",
  "app-polishing-subhead-1": "Advantages for polishing/sanding application",
  "app-polishing-para-2": "Programs for robotic polishing & sanding applications can be generated from the CAD model and subsequently modified with minimal effort to adjust for:",
  "app-polishing-list-1-1": "Change in tool shape",
  "app-polishing-list-1-2": "Diameter of polishing wheel or brush",
  "app-polishing-list-1-3": "Depth of passes",
  "app-polishing-list-1-4": "Number of passes",
  "app-polishing-list-2-1": "With this program, sanding and polishing robots have the ability to automatically manage and change the distance between steps without re-programming the part",
  "app-polishing-list-2-2": "Ability to program and manage tool tilt directions for optimal surface contact increasing the surface finish quality and tool life",
  "app-polishing-list-2-3": "Tool orientations can be managed automatically to optimize the program for minimal wrist rotation and maximize robot reach",
  "app-polishing-list-2-4": "Joint repositioning tools can be used to easily control the robot configurations and wrist winding/unwinding for optimal polishing trajectories",
  "app-polishing-list-2-5": "Calibration tools that compensate for actual part setup",
  "app-polishing-vid-1": "https://www.youtube.com/watch?v=wLQgF_paWCg",
  "app-polishing-vid-1-text": "Simulation of a blisk",
  "app-polishing-vid-2": "https://www.youtube.com/watch?v=Fl6DW2FL7eM",
  "app-polishing-vid-2-text": "Simulation of a propeller using a Fanuc robot",
  "app-polishing-vid-3": "https://www.youtube.com/watch?v=jQUaltNEoyc",
  "app-polishing-vid-3-text": "Simulation of polishing a prosthetic knee",
  "app-polishing-vid-4": "https://www.youtube.com/watch?v=so-gbsb10G8",
  "app-polishing-vid-4-text": "Simulation of polishing",
  "app-rail-para-1": "Robotmaster provides an extensive suite of robotic programming and simulation functionality for rails and rotaries to easily program robots mounted on linear rails or parts mounted on rotary tables. The rails and rotaries can be used as indexers or in full simultaneous motion.",
  "app-rail-subhead-1": "Advantages for programming additional axes",
  "app-rail-list-1-1": "Automatic linear rail programming and rotary table synchronization for indexing or simultaneous 11 axis motion",
  "app-rail-list-1-2": "Ability to manage and optimize rail/rotary axes",
  "app-rail-list-1-3": "Flexible program output can automatically compensate for:",
  "app-rail-list-2-1": "Fixed user frame",
  "app-rail-list-2-2": "Dynamic user frame",
  "app-rail-list-2-3": "Coordinated external motion",
  "app-rail-list-1-4": "Rail or rotary positioning parameters can be used to easily control the robot configuration and posture for optimal trajectories",
  "app-rail-list-1-5": "Ability to program and simulate up to 11-axis simultaneous motion",
  "app-rail-vid-1": "https://www.youtube.com/watch?v=Qyly21HY9UM",
  "app-rail-vid-1-text": "Robot on a rail plasma cutting large metal tube",
  "app-trimming-para-1": "Robot work cells are flexible cost effective solutions for cutting complex shapes on 2 or 3D surfaces using for cutting, routing, trimming or compliant knife tooling, with high speed and precision, without additional finishing steps. Robotmaster automatically programs smooth error-free tool motion and transitions, exploiting your cutting technology parameters to cut accurate shapes and true arcs, and flexible control of external axes.",
  "app-trimming-subhead-1": "Advantages for trimming applications",
  "app-trimming-para-2": "Robot programming for trimming and cutting paths can be generated automatically from the CAD model and subsequently modified with minimal effort to adjust for:",
  "app-trimming-list-1-1": "Diameter of cutter",
  "app-trimming-list-1-2": "Depth of cut",
  "app-trimming-list-1-3": "Number of cuts",
  "app-trimming-list-2-1": "Tool orientations can be managed automatically to optimize the program for minimal wrist rotation and maximize robot reach",
  "app-trimming-list-2-2": "Ability to manage and optimize entries and exits",
  "app-trimming-list-2-3": "Ability to automatically activate/deactivate spindle or tool",
  "app-trimming-list-2-4": "Joint repositioning tools can be used to easily control the robot configurations and wrist winding/unwinding for optimal trimming trajectories",
  "app-trimming-list-2-5": "Ability to program, simulate and use multiple tools",
  "app-trimming-list-2-6": "Calibration tools that compensate for actual part setup",
  "app-trimming-vid-1": "https://www.youtube.com/watch?v=m5bKxfEhX1k",
  "app-trimming-vid-1-text": "Robot program for trimming of a thermoformed aerospace part using a Staubli robot and a small spindle",
  "app-trimming-vid-2": "https://www.youtube.com/watch?v=pVlPd4MuJgk",
  "app-trimming-vid-2-text": "Robot programming for trimming an aerospace part fixtured with a Universal Holding Fixture (UHF) with a KUKA robot",
  "app-trimming-vid-3": "https://www.youtube.com/watch?v=15iMlgafiHQ",
  "app-trimming-vid-3-text": "Robotic programming for trimming",
  "app-welding-para-1": "Robotic welding increases shop productivity and delivers high weld quality in the face of a worldwide shortage of skilled welders. Robotmaster overcomes programming barriers by automating welding paths and parameters, increasing throughput and consistency, regardless of batch size or part complexity.",
  "app-welding-subhead-1": "Advantages for robot welding applications",
  "app-welding-list-1-1": "Robotic programming for welding can be performed automatically from the CAD programming model and subsequently modified with minimal effort to adjust for weld bead size and gun to part distance",
  "app-welding-list-1-2": "Ability to program and manage gun tilt and rotation for optimal weld",
  "app-welding-list-1-3": "Robot welding programming gives you the ability to automatically activate/deactivate the welding gun",
  "app-welding-list-1-4": "Tool orientations can be managed automatically to optimize the program for minimal wrist rotation and maximize robot reach",
  "app-welding-list-1-5": "Calibration tools that compensate for actual part setup",
  "app-welding-vid-1": "https://www.youtube.com/watch?v=UrdA8qLn3l4",
  "app-welding-vid-1-text": "Simulation of pipe/tube welding",
  "app-welding-vid-2": "https://www.youtube.com/watch?v=008fubU-k5o",
  "app-welding-vid-2-text": "Welding of a feedscrew with a Fanuc robot",
  "app-welding-vid-3": "https://www.youtube.com/watch?v=GsSn8TtgVRY",
  "app-welding-vid-3-text": "Welding the joints of a truck bed using a Reis robot",
  "app-welding-vid-4": "https://www.youtube.com/watch?v=Wk-1FGqT8qs",
  "app-welding-vid-4-text": "Welding a pressure vessel with an ABB robot",
  "blog-page-caption": "Newsroom",
  "cta-req-info": "Request Info",
  "cta-req-demo": "Request Demo",
  "contactmereq-page-caption": "Contact Me",
  "contactmereq-page-title": "Contact Me Request",
  "contact-page-caption": "Contact",
  "contact-email-gen-inq-caption": "General inquiries",
  "contact-email-gen-inq": "info@robotmaster.com",
  "contact-email-sales-caption": "Sales",
  "contact-email-sales": "sales@robotmaster.com",
  "contact-email-tech-sup-caption": "Technical support",
  "contact-email-tech-sup": "support@robotmaster.com",
  "contact-email-media-enq-caption": "Media enquiries",
  "contact-email-media-enq": "marketing@robotmaster.com",
  "contact-info-request-caption": "Request info",
  "contact-info-request": "Fill out request form here",
  "contact-address-custom-title": "contact-address-custom-title",
  "contact-address-custom-line-1": "contact-address-custom-line-1",
  "contact-address-custom-line-2": "contact-address-custom-line-2",
  "contact-address-custom-line-3": "contact-address-custom-line-3",
  "contact-address-custom-line-4": "contact-address-custom-line-4",
  "contact-address-title-1": "Headquarters and global sales",
  "contact-address-title-2": "Robotmaster training, implementation, research and development center",
  "contact-reseller-inq": "Reseller inquiries",
  "contact-reseller-para": "We are always looking to increase our distribution network with qualified resellers and robot integrators. If you are interested in learning about what opportunities may exist in your area, please fill out the contact form.",
  "disclaimer-page-caption": "Disclaimer",
  "disclaimer-para-1": "While we endeavour to ensure that the information on this web site is correct and that its functionality is consistent, we do not warrant the accuracy and completeness of any material or information provided on this web site. We may make changes to the material on this web site at any time without notice. The material on this web site may be out of date; and we make no commitment to update such material.",
  "disclaimer-para-2": "The material on this web site is provided \"as is\" without any conditions, warranties or other terms of any kind. Accordingly, to the maximum extent permitted by law, we provide you with this web site on the basis that we exclude all representations, warranties, conditions and other terms (including, without limitation, the conditions implied by law of satisfactory quality, fitness for purpose and the use of reasonable care and skill) which but for these terms and conditions might have effect in relation to this web site.",
  "disclaimer-para-3": "We reserve the right to revise these terms and conditions at any time by updating this page. You should check this page from time to time to review the prevailing terms and conditions, because they are binding on you.",
  "disclaimer-para-4": "Use of this Website indicates that you accept these terms.",
  "disclaimer-para-5": "Robotmaster",
  "events-page-caption": "Events",
  "events-date-title": "Date: ",
  "events-location-title": "Location: ",
  "events-booth-title": "Booth: ",
  "events-venue-title": "Venue: ",
  "events-website-title": "Website",
  "eula-page-caption": "EULA",
  "eula-heading": "ROBOTMASTER SOFTWARE LICENSE AGREEMENT",
  "eula-subheading-important": "IMPORTANT NOTICE!",
  "eula-important-part-1": "PLEASE READ THIS STATEMENT AND THE SOFTWARE LICENSE AGREEMENT COMPLETELY BEFORE USING THIS SOFTWARE. BY CONTINUING TO USE THIS SOFTWARE, YOU (EITHER AN INDIVIDUAL OR A SINGLE ENTITY) INDICATE YOUR INTENTION TO BE BOUND BY AND ACCEPT THE TERMS AND CONDITIONS OF THIS SOFTWARE LICENSE. IF YOU DO NOT AGREE TO THESE TERMS AND CONDITIONS YOU MAY NOT ACCESS OR OTHERWISE USE THIS SOFTWARE AND WILL IN FACT BE PROHIBITED FROM DOING SO. THIS COMPUTER SOFTWARE MAY BE USED ONLY PURSUANT TO THE TERMS AND CONDITIONS SET FORTH BELOW. ",
  "eula-important-part-2": "Robotmaster and Licensee agree that the terms and conditions of this Agreement govern Licensee's use of the Robotmaster Software described below.",
  "eula-subheading-recitals": "RECITALS",
  "eula-recitals-part-1": "{wheras} Robotmaster is the owner of, or has acquired rights to, the Software and Documentation (as defined below).  {wheras} Robotmaster desires to grant to Licensee and Licensee desires to obtain from Robotmaster a non-exclusive license to use the Software and Documentation solely in accordance with the terms and on the conditions set forth in this Agreement.",
  "eula-recitals-part-1-wheras": "WHEREAS",
  "eula-recitals-part-2": "NOW, THEREFORE, the parties hereto agree as follows:",
  "eula-subheading-definitions": "DEFINITIONS",
  "eula-definitions-part-1": "\"Designated Equipment\" shall mean the hardware products with which the Software is licensed for use. \"Documentation\" shall mean all manuals, user documentation, and other related materials pertaining to the Software which are furnished to Licensee by Robotmaster in connection with the Software or during Training Classes provided by Robotmaster. \"License Fee\" shall mean the license fee. \"Software\" shall mean the computer programs in machine readable object code form and any subsequent error corrections or updates that may be supplied to Licensee by Robotmaster pursuant to this Agreement. \"Training Classes\" shall mean the training classes provided by Robotmaster, if Licensee chooses to sign up for such classes. \"Update Service\" shall mean the provision of error corrections, bug fixes, patches or other updates to the Software licensed hereunder in object code form to the extent available, in accordance with Robotmaster's release schedule.",
  "eula-subheading-grantrights": "GRANT OF RIGHTS",
  "eula-grantrights-part-1": "The License granted for Software under this Agreement authorizes Licensee on a nonexclusive basis to use the Software on the Designated Equipment hereto for the license term set forth in GRANT OF RIGHTS. The Software shall be used on the Designated Equipment only such equipment if it is operating properly. If such equipment is down, the Software may be used on a backup system for that system. Use of the Software requires the use of the Mastercam software licensed by CNC Software Inc. Licensee represents and warrants that it holds at least one valid Mastercam licenses. MASTERCAM products and trademarks are owned by CNC Software Inc. This License granted under this Agreement shall remain valid until terminated in accordance with DEFAULT AND TERMINATION below.",
  "eula-subheading-delivery": "DELIVERY",
  "eula-delivery-software": "Software.",
  "eula-delivery-software-para": " Robotmaster shall deliver to Licensee a master copy of the Software licensed hereunder in object code form, suitable for reproduction, in electronic files only.",
  "eula-delivery-docs": "Documentation.",
  "eula-delivery-docs-para": " Robotmaster shall deliver copies of Documentation.",
  "eula-subheading-modifications": "MODIFICATIONS",
  "eula-modifications-updates": "Error Corrections and Updates.",
  "eula-modifications-updates-para": " Robotmaster will provide Licensee with error corrections, bug fixes, patches or other updates to the Software licensed hereunder in object code form to the extent available, in accordance with Robotmaster's release schedule for a period of six (6) months from the date of shipment.",
  "eula-modifications-other": "Other Modifications.",
  "eula-modifications-other-para": " Licensee may, from time to time, request that Robotmaster incorporate certain features, enhancements or modifications into the Software. Robotmaster may, in its sole discretion, undertake to incorporate such changes and distribute the Software so modified to all or any of Robotmaster's licensees.",
  "eula-modifications-title": "Title to Modifications.",
  "eula-modifications-title-para": " All such error corrections, bug fixes, patches, updates or other modifications shall be the sole property of Robotmaster.",
  "eula-subheading-copies": "COPIES",
  "eula-copies-human": "Human Readable Matter.",
  "eula-copies-human-para": " Except as specifically set forth herein, no Software or Documentation which is provided by Robotmaster pursuant to this Agreement in human readable form, such as written or printed documents, shall be copied in whole or in part by Licensee without Robotmaster's prior written agreement. Additional copies of printed materials may be obtained from Robotmaster at the charges then in effect.",
  "eula-copies-machine": "Machine Readable Matter.",
  "eula-copies-machine-para": " Except as specifically set forth herein, any Software provided in machine readable form may not be copied by Licensee in whole or in part, except for Licensee's backup or archive purposes. Licensee agrees to maintain appropriate records of the number and location of all copies of the Software and make such records available upon Robotmaster's request. Licensee further agrees to reproduce all copyright and other proprietary notices on all copies of the Software in the same form and manner that such copyright and other proprietary notices are originally included on the Software.",
  "eula-subheading-licensefees": "LICENSE FEES AND PAYMENT",
  "eula-licensefees-fee": "License Fee.",
  "eula-licensefees-fee-para": " In consideration of the license rights granted in GRANT OF RIGHTS above, Licensee shall pay the License Fees or other consideration for the Software and Documentation. All amounts payable hereunder by Licensee shall be payable in United States funds without deductions for taxes, assessments, fees, or charges of any kind.",
  "eula-licensefees-taxes": "Taxes and Other Charges.",
  "eula-licensefees-taxes-para": " Licensee shall be responsible for paying all (i) sales, use, excise, value-added, or other tax or governmental charges imposed on the licensing or use of the Software or Documentation hereunder, (ii) freight, insurance and installation charges, and (iii) import or export duties or like charges.",
  "eula-subheading-protection": "PROTECTION OF SOFTWARE",
  "eula-protection-security": "Security Mechanism.",
  "eula-protection-security-para": " Licensee shall not use the Program without a Security Mechanism provided by Robotmaster and Robotmaster's suppliers. The software may be used: (a) in executable code form only; and (b) only by the number of users and accessed by the number of end-user computers for which licenses were purchased. Licensee may physically transfer the Program from one computer equipped with a single-user Security Mechanism to another only if the Security Mechanism is included in the transfer and is installed with the new computer. Licensee shall not circumvent, bypass, modify, reverse engineer, disassemble, disable, alter, enhance or replicate the function of the Security Mechanism in any manner whatsoever. Any attempt to do so shall result in automatic termination of this License without prejudice to all other legal rights and remedies of Robotmaster.",
  "eula-protection-proprietary": "Proprietary Notices.",
  "eula-protection-proprietary-para": " Licensee agrees to respect and not to remove, obliterate, or cancel from view any copyright, trademark, confidentiality or other proprietary notice, mark, or legend appearing on any of the Software or output generated by the Software, and to reproduce and include same on each copy of the Software.",
  "eula-protection-noreverse": "No Reverse Engineering.",
  "eula-protection-noreverse-para": " Licensee agrees not to modify, reverse engineer, disassemble, or decompile the Software, or any portion thereof.",
  "eula-protection-ownership": "Ownership.",
  "eula-protection-ownership-para": " Licensee further acknowledges that all copies of the Software in any form provided by Robotmaster or made by Licensee are the sole property of Robotmaster and/or its suppliers. Licensee shall not have any right, title, or interest to any such Software or copies thereof except as provided in this Agreement, and further shall secure and protect all Software and Documentation consistent with maintenance of Robotmaster's proprietary rights therein.",
  "eula-subheading-confidentiality-1": "CONFIDENTIALITY",
  "eula-confi-1-ack": "Acknowledgement.",
  "eula-confi-1-ack-para": " Licensee hereby acknowledges and agrees that the Software and Documentation constitute and contain valuable proprietary products and trade secrets of Robotmaster and/or its suppliers, embodying substantial creative efforts and confidential information, ideas, and expressions. Accordingly, Licensee agrees to treat (and take precautions to ensure that its employees treat) the Software and Documentation as confidential in accordance with the confidentiality requirements and conditions set forth below.",
  "eula-confi-1-maintenance": "Maintenance of Confidential Information.",
  "eula-confi-1-maintenance-para": " Each party agrees to keep confidential all confidential information disclosed to it by the other party in accordance herewith, and to protect the confidentiality thereof in the same manner it protects the confidentiality of similar information and data of its own (at all times exercising at least a reasonable degree of care in the protection of confidential information); provided, however, that neither party shall have any such obligation with respect to use of disclosure to others not parties to this Agreement of such confidential information as can be established to: (a) have been known publicly; (b) have been known generally in the industry before communication by the disclosing party to the recipient; (c) have become know publicly, without fault on the part of the recipient, subsequent to disclosure by the disclosing party; (d) have been known otherwise by the recipient before communication by the disclosing party; or (e) have been received by the recipient without any obligation of confidentiality from a source (other than the disclosing party) lawfully having possession of such information.",
  "eula-confi-1-relief": "Injunctive Relief.",
  "eula-confi-1-relief-para": " Licensee acknowledges that the unauthorised use, transfer or disclosure of the Software and Documentation or copies thereof will (i) substantially diminish the value to Robotmaster of the trade secrets and other proprietary interests that are the subject of this Agreement; (ii) render Robotmaster's remedy at law for such unauthorised use, disclosure or transfer inadequate; and (iii) cause irreparable injury in a short period of time. If Licensee breaches any of its obligations with respect to the use or confidentiality of the Software or Documentation, Robotmaster shall be entitled to equitable relief to protect its interests therein, including, but not limited to, preliminary and permanent injunctive relief.",
  "eula-confi-1-survival": "Survival.",
  "eula-confi-1-survival-para": " Licensee's obligations under CONFIDENTIALITY Article will survive the termination of this Agreement or of any license granted under this Agreement for whatever reason.",
  "eula-subheading-warranties": "WARRANTIES; SUPERIOR RIGHTS",
  "eula-warranties-ownership": "Ownership.",
  "eula-warranties-ownership-para": " Robotmaster represents its belief that it is the owner of the entire right, title, and interest in and to Software, and that it has the sole right to grant licenses thereunder, and that it has not knowingly granted licenses thereunder to any other entity that would restrict rights granted hereunder except as stated herein.",
  "eula-warranties-limited": "Limited Warranty.",
  "eula-warranties-limited-para": " Robotmaster represents and warrants to Licensee that the Software, when properly installed by Licensee and used with the Designated Equipment, will perform substantially as described in Robotmaster's then current Documentation for such Software for a period of ninety (90) days from the date of shipment.",
  "eula-warranties-limitations": "Limitations.",
  "eula-warranties-limitations-para": " Notwithstanding the warranty provisions set forth in LIMITED WARANTY Section above, all of Robotmaster's obligations with respect to such warranties shall be contingent on Licensee's use of the Software in accordance with this Agreement and in accordance with Robotmaster's instructions as provided by Robotmaster in the Documentation, as such instructions may be amended, supplemented, or modified by Robotmaster from time to time. Robotmaster shall have no warranty obligations with respect to any failures of the Software which are the result of accident, abuse, misapplication, extreme power surge or extreme electromagnetic field.",
  "eula-warranties-soleremedy": "Licensee's Sole Remedy.",
  "eula-warranties-soleremedy-para": " Robotmaster's entire liability and Licensee's exclusive remedy shall be, at Robotmaster's option, either (a) return of the price paid or (b) repair or replacement of the Software upon its return to Robotmaster; provided Robotmaster receives written notice from Licensee during the warranty period of a breach of warranty. Any replacement Software will be warranted for the remainder of the original warranty period or thirty (30) days, whichever is longer.",
  "eula-warranties-disclaimer": "Disclaimer of Warranties.",
  "eula-warranties-disclaimer-para": " ROBOTMASTER DOES NOT REPRESENT OR WARRANT THAT ALL ERRORS IN THE SOFTWARE AND DOCUMENTATION WILL BE CORRECTED. THE WARRANTIES STATED IN LIMITED WARRANTY SECTION ABOVE ARE THE SOLE AND THE EXCLUSIVE WARRANTIES OFFERED BY ROBOTMASTER. THERE ARE NO OTHER WARRANTIES RESPECTING THE SOFTWARE AND DOCUMENTATION OR SERVICES PROVIDED HEREUNDER, EITHER EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY OF DESIGN, MERCHANTABILITY, OR FITNESS FOR A PARTICULAR PURPOSE, EVEN IF ROBOTMASTER HAS BEEN INFORMED OF SUCH PURPOSE. NO AGENT OF ROBOTMASTER IS AUTHORISED TO ALTER OR EXCEED THE WARRANTY OBLIGATIONS OF ROBOTMASTER AS SET FORTH HEREIN.",
  "eula-warranties-limitliability": "Limitation of Liability.",
  "eula-warranties-limitliability-para": " LICENSEE ACKNOWLEDGES AND AGREES THAT THE CONSIDERATION WHICH ROBOTMASTER IS CHARGING HEREUNDER DOES NOT INCLUDE ANY CONSIDERATION FOR ASSUMPTION BY ROBOTMASTER OF THE RISK OF LICENSEE'S CONSEQUENTIAL OR INCIDENTAL DAMAGES WHICH MAY ARISE IN CONNECTION WITH LICENSEE'S USE OF THE SOFTWARE AND DOCUMENTATION. ACCORDINGLY, LICENSEE AGREES THAT ROBOTMASTER SHALL NOT BE RESPONSIBLE TO LICENSEE FOR ANY LOSS-OF-PROFIT, INDIRECT, INCIDENTAL, SPECIAL, OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE LICENSING OR USE OF THE SOFTWARE OR DOCUMENTATION. Any provision herein to the contrary notwithstanding, the maximum liability of Robotmaster to any person, firm or corporation whatsoever arising out of or in the connection with any license, use or other employment of any Software delivered to Licensee hereunder, whether such liability arises from any claim based on breach or repudiation of contract, warranty, tort or otherwise, shall in no case exceed the actual price paid to Robotmaster by Licensee for the Software whose license, use, or other employment gives rise to the liability. The essential purpose of this provision is to limit the potential liability of Robotmaster arising out of this Agreement. The parties acknowledge that the limitations set forth in this WARRANTIES; SUPERIOR RIGHTS Article are integral to the amount of consideration levied in connection with the license of the Software and Documentation and any services rendered hereunder and that, were Robotmaster to assume any further liability other than as set forth herein,such consideration would of necessity be set substantially higher.",
  "eula-subheading-confidentiality-2": "CONFIDENTIALITY",
  "eula-confi-2-para": "Robotmaster shall indemnify, hold harmless and defend Licensee against any action brought against Licensee to the extent that such action is based on a claim that the unmodified Software, when used in accordance with this Agreement, infringes a valid copyright and Robotmaster shall pay all costs, settlements and damages finally awarded; provided, that Licensee promptly notifies Institution in writing of any claim, gives Robotmaster sole control of the defence and settlement thereof and provides all reasonable assistance in connection therewith. If any Software is finally adjudged to so infringe, or in Robotmaster's opinion is likely to become the subject of such a claim, Robotmaster shall, at its option, either: (i) procure for Licensee the right to continue using the Software (ii) modify or replace the Software to make it noninfringing, or (iii) refund the fee paid, less reasonable depreciation, upon return of the Software. Robotmaster shall have no liability regarding any claim arising out of: (iv) use of other than a current, unaltered release of the Software unless the infringing portion is also in the then current, unaltered release, (v) use of the Software in combination with non-Robotmaster software, data or equipment if the infringement was caused by such use or combination, (vi) any modification or derivation of the Software not specifically authorised in writing by Robotmaster or (vii) use of third party software. THE FOREGOING STATES THE ENTIRE LIABILITY OF ROBOTMASTER AND THE EXCLUSIVE REMEDY FOR LICENSEE RELATING TO INFRINGEMENT OR CLAIMS OF INFRINGEMENT OF ANY COPYRIGHT OR OTHER PROPRIETARY RIGHT BY THE SOFTWARE. Except for the foregoing infringement claims, Licensee shall indemnify and hold harmless Robotmaster, its officers, agents and employees from and against any claims, demands, or causes of action whatsoever, including without limitation those arising on account of Licensee's modification or enhancement of the Software or otherwise caused by, or arising out of, or resulting from, the exercise or practice of the license granted hereunder by Licensee, its sublicensees, if any, its subsidiaries or their officers, employees, agents or representatives.",
  "eula-subheading-default": "DEFAULT AND TERMINATION",
  "eula-default-events": "Events of Default.",
  "eula-default-events-para": " This Agreement may be terminated by the nondefaulting party if any of the following events of default occur: (1) if a party materially fails to perform or comply with this Agreement or any provision hereof; (2) if either party fails to strictly comply with the provisions of CONFIDENTIALITY Section or makes an assignment in violation of NONASSIGNABILITY Section; (3) if a party becomes insolvent or admits in writing its inability to pay its debts as they mature, or makes an assignment for the benefit of creditors; (4) if a petition under any bankruptcy act, receivership statute, or the like, as they now exist, or as they may be amended, is filed by a party; or (5) if such a petition is filed by any third party, or an application for a receiver is made by anyone and such petition or application is not resolved favourably within ninety (90) days.",
  "eula-default-effective": "Effective Date of Termination.",
  "eula-default-effective-para": " Termination due to a material breach of Articles GRANT OF RIGHTS, COPIES, PROTECTION OF SOFTWARE, or CONFIDENTIALITY shall be effective on notice. In all other cases, termination shall be effective thirty (30) days after notice of termination to the defaulting party if the defaults have not been cured within such thirty (30) day period.",
  "eula-default-obligations": "Obligations on Termination.",
  "eula-default-obligations-para": " Within two (2) days after termination of this Agreement, Licensee shall cease and desist all use of the Software and Documentation and shall return to Robotmaster all full or partial copies of the Software and Documentation in Licensee's possession or under its control.",
  "eula-default-notices": "Notices.",
  "eula-default-notices-para": " All notices, authorisations, and requests in connection with this Agreement shall be deemed given (i) five days after being deposited in the mail, postage prepaid, certified or registered, return receipt requested; or (ii) one day after being sent by overnight courier, charges prepaid, with a confirming fax; and addressed as first set forth above or to such other address as the party to receive the notice or request so designates by written notice to the other.",
  "eula-subheading-nonassign": "NONASSIGNABILITY",
  "eula-nonassign-para": "Licensee shall not transfer or assign the Software or this Agreement or its rights hereunder without the prior written consent of Robotmaster.",
  "eula-subheading-governing": "GOVERNING LAW; JURISDICTION AND VENUE",
  "eula-governing-para": "The validity, interpretation, construction and performance of this Agreement shall be governed by the laws of the Province of Quebec. The courts of the district of Montreal shall have exclusive jurisdiction and venue over any dispute arising out of this Agreement, and Licensee hereby consents to the jurisdiction of such courts.",
  "eula-subheading-severability": "SEVERABILITY",
  "eula-severability-para": "If any provision of this Agreement shall be held by a court of competent jurisdiction to be illegal, invalid or unenforceable, the remaining provisions shall remain in full force and effect.",
  "eula-subheading-misc": "MISCELLANEOUS",
  "eula-misc-para": "This Agreement and its exhibits contain the entire understanding and agreement between the parties respecting the subject matter hereof. This Agreement may not be supplemented, modified, amended, released or discharged except by an instrument in writing signed by each party's duly authorised representative. All captions and headings in this Agreement are for purposes of convenience only and shall not affect the construction or interpretation of any of its provisions. Any waiver by either party of any default or breach hereunder shall not constitute a waiver of any provision of this Agreement or of any subsequent default or breach of the same or a different kind.",
  "footer-section-about": "About Robotmaster",
  "footer-newsroom-whatsnew": "What's new",
  "footer-why-getting-most": "Maximize your robot",
  "footer-why-evolution": "Evolution of OLP",
  "footer-why-solving": "Solving OLP challenges",
  "footer-section-contact": "Contact us",
  "footer-copyright": "Copyright © 2019 Hypertherm, Inc. All Rights Reserved.",
  "footer-v6-brochure": "V6 brochure",
  "footer-general-brochure": "General brochure",
  "footer-terms-of-use": "Terms of Use",
  "footer-gdpr": "GDPR",
  "gdpr.page.caption": "GDPR",
  "gdpr.title": "Hypertherm’s EU General Data Protection Regulation Statement",
  "gdpr.sect1.heading": "Statement",
  "gdpr.sect1.para": "The EU General Data Protection Regulation, effective May 25, 2018 (“GDPR”), aims to strengthen the security and protection of personal data in the European Union and will replace the European Privacy Directive and national legislations accordingly.  The GDPR imposes additional requirements for companies that collect or store personal data of European Union residents.",
  "gdpr.sect2.heading": "Our Commitment",
  "gdpr.sect2.para": "Hypertherm welcomes the arrival of the GDPR.  We are committed to ensuring the security and protection of the personal information that we process to meet the demands of the GDPR.  The success of our company builds on the trust that our associates, customers, and other stakeholders have in our ability to deliver premier quality.  This includes our ability to apply a high level of data protection and security in relation to personal data that our associates, customers, and third parties entrust to us.  Hypertherm considers it not just its duty to comply with national and international data protection regulations, but also to do this by applying the same standards, processes, and procedures throughout our Hypertherm footprint.  This allows us to deliver the transparency, predictability, and consistency that our stakeholders expect from us.  Our preparation and measures for GDPR compliance have been summarized in this statement and include the development and implementation of new data protection preparations, roles, policies, procedures, controls, and measures to ensure maximum and ongoing compliance.",
  "gdpr.sect3.heading": "Preparations",
  "gdpr.sect3.para": "Our policies regarding data protection are focused on providing stakeholders with confidence that their data remains secure.  We have established a number of measures to ensure that stakeholders and their data are treated in a manner consistent with privacy principles. Therefore, our preparations for the GDPR requirements across our organization include:",
  "gdpr.sect3.list1.heading": "Information Audit:",
  "gdpr.sect3.list1.para": "carrying out an information audit from a GDPR lens via data mapping and inventories to identify and assess what personal information we hold, its source, how and why it is processed, and if and to whom it is disclosed.",
  "gdpr.sect3.list2.heading": "Policies & Procedures:",
  "gdpr.sect3.list2.para": "data protection policies and procedures to meet the requirements and standards of the GDPR and any relevant data protection laws, including:",
  "gdpr.sect3.list2.sub1.heading": "Data Protection",
  "gdpr.sect3.list2.sub1.para": "our main policy and procedure document for data protection has been overhauled to meet the standards and requirements of the GDPR.  Accountability and governance measures are in place to ensure that we understand and adequately disseminate and evidence our obligations and responsibilities; with a dedicated focus on privacy by design and the rights of individuals.",
  "gdpr.sect3.list2.sub2.heading": "Data Retention & Erasure",
  "gdpr.sect3.list2.sub2.para": "we have updated our retention policy and schedule to ensure that we meet the ‘data minimization’ and ‘storage limitation’ principles and that personal information is stored, archived and destroyed compliantly and ethically.",
  "gdpr.sect3.list2.sub3.heading": "Data Breaches",
  "gdpr.sect3.list2.sub3.para": "our breach procedures ensure that we have safeguards and measures in place to identify, assess, investigate and report any personal data breach at the earliest possible time. Our procedures are robust and have been disseminated to all employees, making them aware of the reporting lines and steps to follow.",
  "gdpr.sect3.list2.sub4.heading": "International Data Transfers & Third-Party Disclosures",
  "gdpr.sect3.list2.sub4.para": "where Hypertherm stores or transfers personal information outside the EU, we have robust procedures and safeguarding measures in place to secure, encrypt and maintain the integrity of the data.  We are working to put the systems and processes in place to facilitate our continual review of the countries with sufficient adequacy decisions, as well as adopting provisions for binding corporate rules; standard data protection clauses or approved codes of conduct for those countries without.  We carry out strict due diligence checks with all recipients of personal data to assess and verify that they have appropriate safeguards in place to protect the information, ensure enforceable data subject rights and have effective legal remedies for data subjects where applicable.",
  "gdpr.sect3.list2.sub5.heading": "Subject Access Request (“SAR”)",
  "gdpr.sect3.list2.sub5.para": "we have revised our SAR procedures to accommodate the revised, mandated thirty-day timeframe for providing the requested information and for making this provision free of charge. Our new procedures detail how to verify the data subject, steps to take for processing an access request and what exemptions apply to ensure that communications with data subjects are compliant, consistent, and adequate.",
  "gdpr.sect3.list3.heading": "Legal Basis for Processing:",
  "gdpr.sect3.list3.para": "we are reviewing all processing activities to identify the legal basis for processing and ensuring that the basis is appropriate for the activity.  Where applicable, we also maintain records of our processing activities, ensuring that our obligations under Article 30 of the GDPR are met.",
  "gdpr.sect3.list4.heading": "Privacy Policy:",
  "gdpr.sect3.list4.para": "we have our Privacy Notice to comply with the GDPR, ensuring that all individuals whose personal information we process have been informed of why we need it, how it is used, what their rights are, to whom the information is disclosed, and what safeguarding measures are in place to protect their information.  https://www.hypertherm.com/en-US/policies/",
  "gdpr.sect3.list5.heading": "Obtaining Consent:",
  "gdpr.sect3.list5.para": "we have revised our consent mechanisms for obtaining personal data, ensuring that individuals understand what they are providing, why and how we use it and giving clear, defined ways to consent to us processing their information. We have developed stringent processes for recording consent, making sure that we can evidence an affirmative opt-in, along with time and date records; and a straightforward way to withdraw consent at any time.",
  "gdpr.sect3.list6.heading": "Direct Marketing:",
  "gdpr.sect3.list6.para": "we have revised processes for direct marketing, including clear opt-in mechanisms for marketing subscriptions; a clear notice and method for opting out and providing unsubscribe features on all subsequent marketing materials.",
  "gdpr.sect3.list7.heading": "Data Protection Impact Assessments (“DPIA”):",
  "gdpr.sect3.list7.para": "where we process personal information that is considered high risk, involves large scale processing or includes special category/criminal conviction data; we have developed stringent procedures and assessment templates for carrying out impact assessments that comply fully with the GDPR’s Article 35 requirements. We have implemented documentation processes that record each assessment, allow us to rate the risk posed by the processing activity and implement mitigating measures to reduce the risk posed to the data subject.",
  "gdpr.sect3.list8.heading": "Special Categories Data:",
  "gdpr.sect3.list8.para": "where we process any special category information, we do so in complete compliance with the GDPR’s Article 9 requirements and have encryptions and protections on all such data. Special category data is only processed where necessary and is only processed where we have first identified the appropriate Article 9(2) basis. Where we rely on consent for processing, this is explicit and is verified by a signature, with the right to modify or remove consent being clearly signposted.",
  "gdpr.sect4.heading": "Data Subject Rights",
  "gdpr.sect4.para": "In addition to the procedures above, we provide information via our numerous communication means of an individual’s right to access any personal information that Hypertherm processes about them and to request information about:",
  "gdpr.sect4.list1": "What personal data we hold about the individual",
  "gdpr.sect4.list2": "The purposes of the processing",
  "gdpr.sect4.list3": "The categories of personal data concerned",
  "gdpr.sect4.list4": "How long we intend to store the personal data",
  "gdpr.sect4.list5": "If we did not collect the data directly from the individual, information about the source",
  "gdpr.sect4.list6": "The right to have incomplete or inaccurate data about the individual corrected or completed and the process for the request",
  "gdpr.sect4.list7": "The right to request erasure of personal data (where applicable) or to restrict processing in accordance with data protection laws, as well as to object to any direct marketing from us and to be informed about any automated decision-making that we use",
  "gdpr.sect4.list8": "The right to lodge a complaint and who to contact in such instances",
  "gdpr.sect5.heading": "Information Security Measures",
  "gdpr.sect5.para": "Hypertherm takes the privacy and security of individuals and their personal information very seriously and take every reasonable measure and precaution to protect and secure the personal data that we process.  We have robust information security policies and procedures in place to protect personal information from unauthorized access, alteration, disclosure, or destruction and have several layers of security measures, including measures such as access controls, password policy, encryptions, practices, restriction, and authentication types.",
  "gdpr.sect6.heading": "GDPR Roles",
  "gdpr.sect6.para1": "Hypertherm has designated a cross-functional, global team to develop and implement our roadmap for complying with the GDPR.  The team is responsible for promoting awareness of the GDPR across the organization, assessing our GDPR readiness, identifying any gap areas, and implementing the new policies, procedures and measures.",
  "gdpr.sect6.para2": "Hypertherm understands that continuous associate awareness and understanding is vital to the continued compliance of the GDPR and have involved our associates in our preparation plans.  We have implemented an associate notice which will be provided to all associate prior to May 25th, 2018, and forms part of our welcome of the GDPR.",
  "gdpr.sect7.heading": "Further information",
  "gdpr.sect7.para1": "If you have any questions about our preparation for the GDPR, please contact our dedicated privacy contact:",
  "gdpr.sect7.para2": "We are committed to protecting your personal information and being transparent about what information we hold.",
  "gdpr.sect7.link": "DataProtection@Hypertherm.com",
  "home-heading-1-part-1": "What is",
  "home-heading-1-part-2": "Robotmaster?",
  "home-section-1-para": "Robotmaster CAD/CAM for robots seamlessly integrates off-line programming, simulation and code generation, delivering quick, error-free robot programs.",
  "home-section-1-listitem-1": "accurate robot trajectories without teaching points",
  "home-section-1-listitem-2": "“click-and-drag” interactive simulation/editing environment",
  "home-section-1-listitem-3": "automated robot motion optimization",
  "home-section-1-listitem-4": "multiple robot manufacturers compatibility",
  "home-heading-2-part-1": "Why",
  "home-heading-2-part-2": "Robotmaster?",
  "home-section-2-para": "Robotmaster dramatically reduces robot off-line programming time and effort with:",
  "home-section-2-listitem-1": "optimized trajectories generated automatically from CAD/CAM files",
  "home-section-2-listitem-2": "automatic resolution of singularity, collision, joint and reach limit issues",
  "home-section-2-listitem-3": "a unique, intuitive “click-and-drag” simulation environment to fine-tune paths and transitions",
  "home-section-2-listitem-4": "tools to optimize part positioning, tool tilt and effective control of external axes",
  "home-section-2-listitem-5": "application screens for customizable process-specific control (e.g., welding, cutting, etc.)",
  "home-heading-3": "Applications",
  "home-section-3-para": "Robotmaster is the ideal off-line programming solution for all applications that require CAD/CAM for robots including: trimming, 3D machining, deburring, polishing, welding, dispensing, grinding, painting...",
  "home-section-4-para": "At Robotmaster, we are taking great strides by revolutionizing the programming of emerging robotic applications. By doing so, we are better serving the increasing demand for manufacturers who seek to adopt robots for part production with little or no expertise in robotics. Robotmaster’s industrial robot programming software removes several of the biggest hurdles in the robotics landscape - the implementation cost and knowledge required for interactive simulation and error-free robot programming. If you're looking to generate more profit with your robot with a simplified yet high-performance software, Robotmaster is the definitive choice.",
  "inforeq-page-caption": "Information request form",
  "inforeq-form-field-name": "Name",
  "inforeq-form-field-email": "Email",
  "inforeq-form-field-company": "Company",
  "inforeq-form-field-country": "Country",
  "inforeq-form-field-province": "State",
  "inforeq-form-field-phone": "Phone",
  "inforeq-form-field-message": "Message",
  "inforeq-form-field-message-placeholder": "Please provide additional information about your needs or list any questions you may have.",
  "inforeq-form-field-robot-placeholder": "Leave blank if you are not a robot",
  "inforeq-form-field-robot-warning": "Are you sure you are a robot?",
  "inforeq-success-page-caption": "Information request successful",
  "inforeq-success-message": "Your information request was sent successfully.",
  "inforeq-success-additive-manufacturing-message": "Your information request for robotic additive manufacturing was sent successfully!",
  "inforeq-success-additive-manufacturing-message-2": "Your information request for robotic additive manufacturing was sent successfully!",
  "inforeq-success-additive-manufacturing-message-3": "Your information request for robotic additive manufacturing was sent successfully!",
  "inforeq-success-additive-manufacturing-message-4": "Your information request for robotic additive manufacturing was sent successfully!",
  "inforeq-success-generic-message-1": "Your generic information request was sent successfully!",
  "inforeq-success-generic-message-2": "Your generic information request was sent successfully!",
  "inforeq-success-generic-message-3": "Your generic information request was sent successfully!",
  "inforeq-success-generic-message-4": "Your generic information request was sent successfully!",
  "inforeq-success-generic-message-5": "Your generic information request was sent successfully!",
  "inforeq-success-generic-message-6": "Your generic information request was sent successfully!",
  "lang-chooser-choose-language": "Choose language",
  "livedemoreq-page-caption": "Live Demo",
  "livedemoreq-page-title": "Live Demo Request",
  "navbar-toggle-nav": "Toggle navigation",
  "notfound-page-caption": "Page Not Found",
  "notfound-page-message": "This content has been moved or no longer available. Thank you for your understanding.",
  "notfound-page-homepage-button": "Back to the Homepage",
  "partners-page-caption": "Partners",
  "partners-heading": "Robots supported",
  "partners-sub-heading": "Robotmaster offers turn-key solutions for the following robot brands",
  "privacy-page-caption": "Privacy",
  "privacy-section-1-para-1": "At Robotmaster, we are committed to protecting your privacy and to developing technology that gives you the most powerful and secure online experience. You can travel through most of our site without giving us any information about yourself. But sometimes we do need information to provide services that you request, and this statement of privacy explains data collection and use in those situations. Please read the complete Robotmaster privacy statement.",
  "privacy-heading-2": "Cookies, web beacons and other technologies",
  "privacy-section-2-para-1": "A cookie is an element of data that a Web site can send to your browser, which may then be stored on your system. Some Robotmaster pages use cookies, sent by Robotmaster to better serve you when you return to the site. You can set your browser to notify you before you receive a cookie, giving you the chance to decide whether to accept it. You can also set your browser to turn off cookies. If you do so, however, some areas of some sites may not function properly. Robotmaster Web site also uses Web beacon technologies to better tailor those sites to provide better customer service. These \"Web beacons\" are placed on a number of pages across Robotmaster's Web site. When a visitor accesses these pages, an anonymous notice of that visit is generated which may be processed by us.",
  "privacy-section-2-para-2": "These Web beacons work in conjunction with cookies. If you don't want to associate your anonymous cookie information with your visits to these pages, you can set your browser to turn off cookies.If you turn off cookies, web beacon technologies will still detect anonymous visits to these pages, but the notices they generate cannot be associated with other anonymous cookie information and are disregarded.",
  "privacy-heading-3": "Privacy technology",
  "privacy-section-3-para-1": "Technology will increasingly help you to have more control over your personal information. It will also help organizations to manage their privacy practices and policies. As an information technology provider, Robotmaster actively supports the development of privacy technologies to help achieve these goals, and to help create greater trust and confidence in the way personal information is handled. Products and services are available which can help give you privacy protection while navigating the Web.",
  "privacy-section-3-para-2": "See {resources}  for an overview of many privacy-related tools.",
  "privacy-section-3-para-3": "Please note that Robotmaster has not formally evaluated all of these tools.",
  "privacy-section-3-para-4": "Questions regarding this statement should be directed to the Robotmaster site coordinator",
  "privacy-section-3-para-5": "{webmaster} for clarification or at:",
  "privacy-section-3-para-5-webmaster": "webmaster@robotmaster.com",
  "privacy-heading-4": "Customer Information Privacy Practices",
  "products-page-caption": "Products",
  "products-title-1": "What is Robotmaster",
  "products-title-2": "Interactive Simulation Environment",
  "products-title-3": "Main Features",
  "products-what-lead": "Robotmaster CAD/CAM for robots seamlessly integrates off-line programming, simulation and code generation, delivering quick, error-free robot programs.",
  "products-what-list-1": "accurate robot trajectories without teaching points",
  "products-what-list-2": "“click-and-drag” interactive simulation/editing environment",
  "products-what-list-3": "automated robot motion optimization",
  "products-what-list-4": "multiple robot manufacturers compatibility",
  "products-inter-lead": "Robotmaster helps manufacturers use robots to produce higher quality products at lower cost, with the speed and flexibility needed to challenge competitors around the world.",
  "products-inter-text": "Singularity, calibration, collisions, reach limitations, and motion granularity are uniquely complex to robotic systems and can make programming particularly cumbersome. Robotmaster’s Interactive Simulation Environment (RISE) provides a unique tool for programming, visualizing and optimizing processes/events quickly and easily.",
  "products-feat-title-1": "Optimization",
  "products-feat-text-1": "Robotmaster gives rapid visualisation of issues and opportunities to easily obtain optimal robot programs.  Its full interactivity makes it the comprehensive tool to find the best solution, without point-by-point intervention, even through a narrow band of opportunity.  Instead of the usual frustrating hit-and-miss approach, quickly create error-free programs, without possessing highly specialised robotic knowledge.",
  "products-feat-list-1-1": "All errors are visualized and mapped in a single screen and color coded by type",
  "products-feat-list-1-2": "Full set of all possible solutions is generated and ranked based on user selected criteria",
  "products-feat-list-1-3": "A few clicks in the error screen adjust the paths correcting all problems",
  "products-feat-list-1-4": "Ability to optimize multiple parameters simultaneously including: tool rotation, tool tilt and rail & rotary positions",
  "products-feat-title-2": "Workspace Analysis",
  "products-feat-text-2": "Click-and-drag simplicity to solve robot reach and work piece positioning issues with real-time  visualization and validation – an essential tool for exploring work cell configuration and defining optimum positioning of the work piece.",
  "products-feat-list-2-1": "Easy visualisation of the task space required by all operations superimposed over the work cell boundaries",
  "products-feat-list-2-2": "Click and drag to re-position and/or re-orient the workpiece with dynamic feedback showing the full impact of changes made on all operations",
  "products-feat-title-3": "Transitions Manager",
  "products-feat-text-3": "Robotmaster easily programs collision-free transitions that minimize cycle time between operations.",
  "products-feat-list-3-1": "Robotmaster automates the onerous task of moving the robot joint-by-joint to create safe transition paths",
  "products-feat-list-3-2": "Automated and semi-automated interactive tool set to eliminate errors and collisions",
  "products-feat-list-3-3": "Optimizes the robot posture and configuration automatically to successfully perform the next task",
  "products-feat-title-4": "6-axis Contouring",
  "products-feat-text-4": "Powerful, integrated 6-axis contour programing empowers the process expert to create optimised programs without having to learn complex CAD/CAM and intricate robot simulation skills.",
  "products-feat-list-4-1": "One-click contour identification and programming even on complex edges and for any CAD model",
  "products-feat-list-4-2": "Easy and extensive contour editing capabilities, without requiring CAD/CAM skills",
  "products-feat-list-4-3": "Ability to dynamically edit the path to change the tool position and orientation",
  "products-feat-list-4-4": "Powerful, best-in-class contour creation specifically designed for robot programming",
  "products-feat-title-5": "External axis management",
  "products-feat-text-5": "With Robotmaster, the entire robotic cell including all external axes is managed as one integrated system- effortlessly control the motion of all axes, including rails and rotaries, to fully exploit and optimize processing of even the largest and most complex work pieces.",
  "products-feat-list-5-1": "Ability to index external axes and/or program them for fully coordinated motion",
  "products-feat-list-5-2": "Combined, simultaneous coordination of external axes for ideal tool orientation",
  "products-feat-list-5-3": "The full power of Robotmaster optimization to control all external axes.",
  "products-feat-title-6": "Custom process definition",
  "products-feat-text-6": "Robotmaster speaks your process language - streamlined, application-specific user interfaces that allow the process expert to set and manage his optimal parameters.",
  "products-feat-list-6-1": "The integration of parameters specific to the user’s process (e.g. welding, cutting, etc.) is simplified with the modifiable screens that define the interaction, terminology and control setting unique to the application",
  "products-feat-list-6-2": "The process parameters can be created, modified and fully controlled by the user for the entire program, specific operations or at select points",
  "ribbon-heading-1": "Events",
  "ribbon-heading-2": "Newsroom",
  "ribbon-heading-3": "What's New",
  "ribbon-desc-1": "See a demonstration of Robotmaster software at various events throughout the year.",
  "ribbon-desc-2": "To find out what's new at Robotmaster, please click here.",
  "ribbon-desc-3": "Robotmaster V7",
  "slideshow-img-1": "/img/slide00.png",
  "slideshow-img-2": "/img/slide01.png",
  "slideshow-img-3": "/img/slide02.png",
  "slideshow-img-4": "/img/slide03.png",
  "slideshow-img-5": "/img/slide04.png",
  "slideshow-img-6": "/img/slide05.png",
  "slideshow-img-7": "/img/slide06.png",
  "success-page-caption": "Success stories",
  "success-section-1-title": "Customer",
  "success-section-2-title": "Media articles",
  "topbar-support": "Support",
  "topbar-live-demo": "LIVE DEMO",
  "topbar-contact-me": "CONTACT ME",
  "whats-new-page-caption": "What's New",
  "whats-new-page-title-v64": "Robotmaster V6.4",
  "whats-new-v64-para-1": "We are glad to announce that Robotmaster V6.4 is now available!",
  "whats-new-v64-sub-heading": "What's New in 6.4:",
  "whats-new-v64-listitem-1": "Collision group modification now possible through RISE.",
  "whats-new-v64-listitem-2": "Collision control can now be set for each component of the tool and tooling.",
  "whats-new-v64-listitem-3": "Ability to detect a collision when the cutting portion of the tool interferes with the workpiece during a joint (non-cutting) move.",
  "whats-new-v64-listitem-4": "New Zigzag profile tracking. The profile tracking angle is reversed during each transition. This is a new strategy that is ideal for applications that require zig-zag paths like polishing and grinding.",
  "whats-new-v64-listitem-5": "Optimization and simulation are now integrated. Optimization spline modifications can be seen in real time on the simulation screen. For the moment only optimization for rotation around the tool is supported.",
  "whats-new-v64-listitem-6": "New rail strategy for minimizing robot elbow movement.",
  "whats-new-v64-listitem-7": "New Rail control option (Fixed index position with respect to the start point or the center of the toolpath).",
  "whats-new-v64-listitem-8": "Partial support for positioning a rotary on which a gantry is mounted (The gantry can include rails and a robot). This configuration is typically used for welding cells.",
  "whats-new-v64-listitem-9": "New space mouse support added.",
  "whats-new-page-title-v63": "Robotmaster V6.3",
  "whats-new-description": "We are pleased to announce the immediate availability of Robotmaster V6.3! The new version features enhancements to flexibility, stability, and speed.",
  "whats-new-sub-heading": "What's new:",
  "whats-new-listitem-1": "New tilt optimization around Tool Center Point (TCP)",
  "whats-new-listitem-1-subitem": "Tilt optimization is now possible around the TCP X and Y axis. This new feature is a powerful tool for optimizing certain types of multi-axis toolpaths",
  "whats-new-listitem-2": "Point editing in relative coordinates",
  "whats-new-listitem-2-subitem": "Relative translation and/or rotation is now possible for point editing",
  "whats-new-listitem-3": "Transform operations support for Basic Edition",
  "whats-new-listitem-3-subitem": "Toolpath transform operations are now supported in the Basic Edition. The source toolpaths used in these operations are limited to the ones allowed for the Basic Edition (2D, Curve 5axis, Drill 5axis)",
  "whats-new-para-1": "For additional help with updating your existing software, please contact our {supportPage}.",
  "whats-new-para-1-supportPage": "support department",
  "whats-new-para-2": "For any questions pertaining to sales, training, or general enquiries please contact us at {salesEmail}",
  "whats-new-para-2-salesEmail": "sales@robotmaster.com",
  "whats-new-para-3": "Thank you for your continued support,",
  "whats-new-para-4": "The Robotmaster Team",
  "whats-new-v65-title": "Robotmaster V6.5",
  "whats-new-v65-para": "We are glad to announce that Robotmaster V6.5 is now available!",
  "whats-new-v65-heading-1": "What's new in 6.5",
  "whats-new-v65-list-1-item-1": "Enhanced optimization maps for tool tilting and around tool Z axis",
  "whats-new-v65-list-1-item-2": "Expanded material addition simulation for additive manufacturing",
  "whats-new-v65-list-1-item-3": "Enhanced spray and coverage simulation",
  "whats-new-v65-list-1-item-4": "Enhanced tool library support",
  "whats-new-v65-list-1-item-5": "Enhanced simulation event processor (SEP)",
  "whats-new-v65-list-1-item-6": "Enhanced support of the 3P3R robots (6 axis robots with 3 linear and 3 rotary axis)",
  "whats-new-v65-list-1-item-7": "Improved cell setup utility",
  "whats-new-v65-list-1-item-8": "Mastercam 2017 Adapter",
  "whats-new-v65-list-1-item-9": "Mastercam X9 and 2017 - new tool types support",
  "whats-new-v65-list-1-item-10": "Enhanced Robotmaster SDK",
  "whats-new-v65-list-1-item-11": "Updated Japanese help files",
  "whats-new-v65-list-1-item-12": "Expanded NC file import",
  "whats-new-v65-list-1-item-13": "And More",
  "whats-new-v65-heading-2": "Post-processor enhancements",
  "whats-new-v65-list-2-item-1": "Additive manufacturing module support has been added to ABB, Fanuc, Kuka, Motoman and Staubli Post Processors",
  "whats-new-v65-list-2-item-2": "Staubli:",
  "whats-new-v65-list-2-item-2-subitem-1": "Enhanced support of external axis output (up to 3 rails & 2 rotaries)",
  "whats-new-v65-list-2-item-2-subitem-2": "Enhanced management to macro calls (wait commands, disabling the “Call” output, etc.)",
  "whats-new-v65-list-2-item-3": "Kuka:",
  "whats-new-v65-list-2-item-3-subitem-1": "Improved new base synchronization",
  "whats-new-v65-list-2-item-3-subitem-2": "Enhanced Kuka IIWA support",
  "whats-new-v65-list-2-item-4": "Fanuc:",
  "whats-new-v65-list-2-item-4-subitem-1": "Enhanced multi-turn joint 5 support (e.g. P-250 series)",
  "whats-new-v65-list-2-item-5": "Universal Robots:",
  "whats-new-v65-list-2-item-5-subitem-1": "Enhanced joint speed support",
  "whats-new-v65-heading-3": "Bugs fixed",
  "whats-new-v65-list-3-item-1": "Collision on joint move during a safe approach or safe retract",
  "whats-new-v65-list-3-item-2": "Collision optimization map error caused from tool tilting",
  "whats-new-v65-list-3-item-3": "Opening an old file displaying incorrect message",
  "whats-new-v65-list-3-item-4": "Collisions not detected between the holder and the fixture",
  "whats-new-v65-list-3-item-5": "Tool tilting issue with co-linear toolpath points",
  "whats-new-v65-list-3-item-6": "Robot setup utility with parallel link robots",
  "whats-new-v65-list-3-item-7": "Rail control with base transformation",
  "whats-new-v65-list-3-item-8": "Synchronization issue when using “Save As”",
  "whats-new-v65-list-3-item-9": "And More",
  "whats-new-v66-title": "Robotmaster V7",
  "whats-new-v66-para": "We are glad to announce that Robotmaster V6.6 is now available!",
  "whats-new-v66-heading-1": "What's new in 6.6",
  "whats-new-v66-list-1-item-1": "Optional additive manufacturing modules (Laser Aided Manufacturing, 3D printing module)",
  "whats-new-v66-list-1-item-2": "Improve the NC import (Gcode/ATP import) -  Import Tool Number and Spindle Speed",
  "whats-new-v66-list-1-item-3": "Improvements on the spray module",
  "whats-new-v66-list-1-item-4": "Improvements on material deposition module",
  "whats-new-v66-list-1-item-5": "Robotmaster SDK improved",
  "whats-new-v66-list-1-item-6": "Mastercam 2018 Adapter",
  "whats-new-v66-list-1-item-7": "Bug fixes",
  "whats-new-v66-list-1-item-8": "and more...",
  "whats-new-v66-heading-2": "Features Removed",
  "whats-new-v66-list-2-item-1": "Mastercam X8 - Adapter",
  "why-page-caption": "Why Robotmaster",
  "why-title-1": "Robotmaster CAD/CAM Programming",
  "why-title-2": "Solving Robotic Programming Challenges",
  "why-prog-lead": "Our strong background in CAD/CAM (Computer Aided Manufacturing) software has enabled us to bring a revolutionary approach to programming industrial robots.",
  "why-prog-sublead": "Robotmaster delivers unmatched, full-function off-line programming capability for robots - easy programming of precise robot motion control and quick generation of path trajectories of any size, with minimal programmer intervention.",
  "why-prog-block-1-title": "Enables your robot for short production runs, even for runs of one!",
  "why-prog-block-2-title": "Facilitates the most complex application tasks",
  "why-prog-block-3-title": "Maximizes the productivity and profitability of your robot",
  "why-prog-block-4-title": "Takes the programmer out of programming",
  "why-prog-block-1-text": "Robotmaster shrinks robotic programming time from hours to minutes by generating robot control code directly from CAD/CAM tools.",
  "why-prog-block-2-text": "Robotmaster delivers the closest conformance to design, creating accurate robot trajectories, optimized for your process and tooling, accurately, without teaching points.",
  "why-prog-block-3-text": "Robotmaster programming is completely off-line, decoupling planning and set-up from production. Its powerful workspace simulation tools assure error-free consideration of workspace and part orientation and constraints.",
  "why-prog-block-4-text": "Robotmaster provides intuitive, graphical interfaces customized to your application, that allow your process expert to apply his knowledge and experience to get the best results without having to become an expert in  industrial robotics or robot software.",
  "why-solve-lead": "Struggling to program a robot the way you do a CNC machine tool? Robotmaster is up to the challenge:",
  "why-solve-block-1-title": "Not easy to intuitively check robot joint limits and robot-to-part collisions?",
  "why-solve-block-2-title": "Need to manually touch-up and rework your off-line programmed points?",
  "why-solve-block-3-title": "Is CAD/CAM data not enough to provide position and orientation data for a 6-axis robot?",
  "why-solve-block-4-title": "Does your program produce errors and stops running when it passes through a robot singularity?",
  "why-solve-block-5-title": "How do you select from up to 8 possible configurations for your robot for every one of its programmed points?",
  "why-solve-block-6-title": "Are inaccuracies in your part or tool setup causing production delays as you make tedious manual adjustments?",
  "why-solve-block-1-text": "Robotmaster automatically checks programs for joint limits, robot reach limitations and collisions.",
  "why-solve-block-2-text": "Robotmaster inherently calculates robot joint values and properly sets parameters to give seamless program playback without manual intervention.",
  "why-solve-block-3-text": "Robotmaster uses automated settings for orienting the robot tool to manage trajectories with complex orientation changes.",
  "why-solve-block-4-text": "Robotmaster checks for singularity and has powerful tools to correct programs containing singularities.",
  "why-solve-block-5-text": "Robotmaster can vary configurations for optimal programming of trajectories or follow your specific robot configuration choice.",
  "why-solve-block-6-text": "Robotmaster eliminates adjustments and increases program accuracy by calibrating the physical part and tool setup with the virtual CAD model.",
  "cc.AF": "Afghanistan",
  "cc.AX": "Aland Islands",
  "cc.AL": "Albania",
  "cc.DZ": "Algeria",
  "cc.AS": "American Samoa",
  "cc.AD": "Andorra",
  "cc.AO": "Angola",
  "cc.AI": "Anguilla",
  "cc.AQ": "Antarctica",
  "cc.AG": "Antigua And Barbuda",
  "cc.AR": "Argentina",
  "cc.AM": "Armenia",
  "cc.AW": "Aruba",
  "cc.AU": "Australia",
  "cc.AT": "Austria",
  "cc.AZ": "Azerbaijan",
  "cc.BS": "Bahamas",
  "cc.BH": "Bahrain",
  "cc.BD": "Bangladesh",
  "cc.BB": "Barbados",
  "cc.BY": "Belarus",
  "cc.BE": "Belgium",
  "cc.BZ": "Belize",
  "cc.BJ": "Benin",
  "cc.BM": "Bermuda",
  "cc.BT": "Bhutan",
  "cc.BO": "Bolivia",
  "cc.BA": "Bosnia and Herzegovina",
  "cc.BW": "Botswana",
  "cc.BV": "Bouvet Island",
  "cc.BR": "Brazil",
  "cc.VG": "British Virgin Islands",
  "cc.IO": "British Indian Ocean Territory",
  "cc.BN": "Brunei Darussalam",
  "cc.BG": "Bulgaria",
  "cc.BF": "Burkina Faso",
  "cc.BI": "Burundi",
  "cc.KH": "Cambodia",
  "cc.CM": "Cameroon",
  "cc.CA": "Canada",
  "cc.CV": "Cape Verde",
  "cc.KY": "Cayman Islands",
  "cc.CF": "Central African Republic",
  "cc.TD": "Chad",
  "cc.CL": "Chile",
  "cc.CN": "China",
  "cc.HK": "Hong Kong, SAR China",
  "cc.MO": "Macao, SAR China",
  "cc.CX": "Christmas Island",
  "cc.CC": "Cocos (Keeling) Islands",
  "cc.CO": "Colombia",
  "cc.KM": "Comoros",
  "cc.CG": "Congo",
  "cc.CD": "Congo, Democratic Republic",
  "cc.CK": "Cook Islands",
  "cc.CR": "Costa Rica",
  "cc.CI": "Cote D'Ivoire",
  "cc.HR": "Croatia",
  "cc.CU": "Cuba",
  "cc.CY": "Cyprus",
  "cc.CZ": "Czech Republic",
  "cc.DK": "Denmark",
  "cc.DJ": "Djibouti",
  "cc.DM": "Dominica",
  "cc.DO": "Dominican Republic",
  "cc.EC": "Ecuador",
  "cc.EG": "Egypt",
  "cc.SV": "El Salvador",
  "cc.GQ": "Equatorial Guinea",
  "cc.ER": "Eritrea",
  "cc.EE": "Estonia",
  "cc.ET": "Ethiopia",
  "cc.FK": "Falkland Islands (Malvinas)",
  "cc.FO": "Faroe Islands",
  "cc.FJ": "Fiji",
  "cc.FI": "Finland",
  "cc.FR": "France",
  "cc.GF": "French Guiana",
  "cc.PF": "French Polynesia",
  "cc.TF": "French Southern Territories",
  "cc.GA": "Gabon",
  "cc.GM": "Gambia",
  "cc.GE": "Georgia",
  "cc.DE": "Germany",
  "cc.GH": "Ghana",
  "cc.GI": "Gibraltar",
  "cc.GR": "Greece",
  "cc.GL": "Greenland",
  "cc.GD": "Grenada",
  "cc.GP": "Guadeloupe",
  "cc.GU": "Guam",
  "cc.GT": "Guatemala",
  "cc.GG": "Guernsey",
  "cc.GN": "Guinea",
  "cc.GW": "Guinea-Bissau",
  "cc.GY": "Guyana",
  "cc.HT": "Haiti",
  "cc.HM": "Heard Island & Mcdonald Islands",
  "cc.VA": "Holy See (Vatican City State)",
  "cc.HN": "Honduras",
  "cc.HU": "Hungary",
  "cc.IS": "Iceland",
  "cc.IN": "India",
  "cc.ID": "Indonesia",
  "cc.IR": "Iran, Islamic Republic Of",
  "cc.IQ": "Iraq",
  "cc.IE": "Ireland",
  "cc.IM": "Isle Of Man",
  "cc.IL": "Israel",
  "cc.IT": "Italy",
  "cc.JM": "Jamaica",
  "cc.JP": "Japan",
  "cc.JE": "Jersey",
  "cc.JO": "Jordan",
  "cc.KZ": "Kazakhstan",
  "cc.KE": "Kenya",
  "cc.KI": "Kiribati",
  "cc.KP": "North Korea",
  "cc.KR": "South Korea",
  "cc.KW": "Kuwait",
  "cc.KG": "Kyrgyzstan",
  "cc.LA": "Lao People's Democratic Republic",
  "cc.LV": "Latvia",
  "cc.LB": "Lebanon",
  "cc.LS": "Lesotho",
  "cc.LR": "Liberia",
  "cc.LY": "Libyan Arab Jamahiriya",
  "cc.LI": "Liechtenstein",
  "cc.LT": "Lithuania",
  "cc.LU": "Luxembourg",
  "cc.MK": "Macedonia",
  "cc.MG": "Madagascar",
  "cc.MW": "Malawi",
  "cc.MY": "Malaysia",
  "cc.MV": "Maldives",
  "cc.ML": "Mali",
  "cc.MT": "Malta",
  "cc.MH": "Marshall Islands",
  "cc.MQ": "Martinique",
  "cc.MR": "Mauritania",
  "cc.MU": "Mauritius",
  "cc.YT": "Mayotte",
  "cc.MX": "Mexico",
  "cc.FM": "Micronesia, Federated States Of",
  "cc.MD": "Moldova",
  "cc.MC": "Monaco",
  "cc.MN": "Mongolia",
  "cc.ME": "Montenegro",
  "cc.MS": "Montserrat",
  "cc.MA": "Morocco",
  "cc.MZ": "Mozambique",
  "cc.MM": "Myanmar",
  "cc.NA": "Namibia",
  "cc.NR": "Nauru",
  "cc.NP": "Nepal",
  "cc.NL": "Netherlands",
  "cc.AN": "Netherlands Antilles",
  "cc.NC": "New Caledonia",
  "cc.NZ": "New Zealand",
  "cc.NI": "Nicaragua",
  "cc.NE": "Niger",
  "cc.NG": "Nigeria",
  "cc.NU": "Niue",
  "cc.NF": "Norfolk Island",
  "cc.MP": "Northern Mariana Islands",
  "cc.NO": "Norway",
  "cc.OM": "Oman",
  "cc.PK": "Pakistan",
  "cc.PW": "Palau",
  "cc.PS": "Palestinian Territory, Occupied",
  "cc.PA": "Panama",
  "cc.PG": "Papua New Guinea",
  "cc.PY": "Paraguay",
  "cc.PE": "Peru",
  "cc.PH": "Philippines",
  "cc.PN": "Pitcairn",
  "cc.PL": "Poland",
  "cc.PT": "Portugal",
  "cc.PR": "Puerto Rico",
  "cc.QA": "Qatar",
  "cc.RE": "Reunion",
  "cc.RO": "Romania",
  "cc.RU": "Russian Federation",
  "cc.RW": "Rwanda",
  "cc.BL": "Saint Barthelemy",
  "cc.SH": "Saint Helena",
  "cc.KN": "Saint Kitts And Nevis",
  "cc.LC": "Saint Lucia",
  "cc.MF": "Saint Martin",
  "cc.PM": "Saint Pierre And Miquelon",
  "cc.VC": "Saint Vincent And Grenadines",
  "cc.WS": "Samoa",
  "cc.SM": "San Marino",
  "cc.ST": "Sao Tome And Principe",
  "cc.SA": "Saudi Arabia",
  "cc.SN": "Senegal",
  "cc.RS": "Serbia",
  "cc.SC": "Seychelles",
  "cc.SL": "Sierra Leone",
  "cc.SG": "Singapore",
  "cc.SK": "Slovakia",
  "cc.SI": "Slovenia",
  "cc.SB": "Solomon Islands",
  "cc.SO": "Somalia",
  "cc.ZA": "South Africa",
  "cc.GS": "South Georgia And Sandwich Isl.",
  "cc.SS": "South Sudan",
  "cc.ES": "Spain",
  "cc.LK": "Sri Lanka",
  "cc.SD": "Sudan",
  "cc.SR": "Suriname",
  "cc.SJ": "Svalbard And Jan Mayen",
  "cc.SZ": "Swaziland",
  "cc.SE": "Sweden",
  "cc.CH": "Switzerland",
  "cc.SY": "Syrian Arab Republic",
  "cc.TW": "Taiwan",
  "cc.TJ": "Tajikistan",
  "cc.TZ": "Tanzania",
  "cc.TH": "Thailand",
  "cc.TL": "Timor-Leste",
  "cc.TG": "Togo",
  "cc.TK": "Tokelau",
  "cc.TO": "Tonga",
  "cc.TT": "Trinidad And Tobago",
  "cc.TN": "Tunisia",
  "cc.TR": "Turkey",
  "cc.TM": "Turkmenistan",
  "cc.TC": "Turks And Caicos Islands",
  "cc.TV": "Tuvalu",
  "cc.UG": "Uganda",
  "cc.UA": "Ukraine",
  "cc.AE": "United Arab Emirates",
  "cc.GB": "United Kingdom",
  "cc.US": "United States",
  "cc.UM": "United States Outlying Islands",
  "cc.UY": "Uruguay",
  "cc.UZ": "Uzbekistan",
  "cc.VU": "Vanuatu",
  "cc.VE": "Venezuela",
  "cc.VN": "Vietnam",
  "cc.VI": "Virgin Islands, U.S.",
  "cc.WF": "Wallis And Futuna",
  "cc.EH": "Western Sahara",
  "cc.YE": "Yemen",
  "cc.ZM": "Zambia",
  "cc.ZW": "Zimbabwe",
  "confirmation-email-live-demo-message": "to arrange for your live demonstration of the software",
  "confirmation-email-contact-message": "and will be pleased to reply to any questions you have about the software",
  "confirmation-email-subject": "Thank you for contacting Robotmaster"
}